# 1) Jaden Casing Strings



def to_jaden_case(string):
    st = string.split()
    new = []
    
    for line in st:
        new.append(line[0].upper() + line[1:].lower())
    return ' '.join(new)
    
    #  ესეიგი სტრინგი იყოფა ცალკე სიტყვებზე split ის მშვეობით
    #  შემდეგ ციკლით თითოეულ სიტყვაზე გადავა გადაამოწმებს მერე
    # პირველი ასო იქნება დიდი upper ის გამოყენებით და დანარჩენი იქნება 
    # პატარა lower ის გამოყენებით ყველა სიტყვა გაივლის ასევთქვათ ტესტს მერე 
    # იქმნება სია ახალი და ნუ მერე იქნმნება ის სტრინგი ვსო 