#3) შექმენით ცვლადი რომელიც იქნება credit და უნდა შექმნათ კიდე 2 ცვლადი რომელიც იქნება credit დიდი ასოებით და ახსენით კომენტარებით რა განსხვავებაა ამ ცვლადების შორის


credit = 19
Credit = 19
CREDIT = 19
 
# როგრც ვიცით დიდი და პატარა ასო განსხვავდება ერთმანეთისგან , როგორც Print ჩვენ თუ დავწერთ პატარა ასოთი print ეს იქნება შეცდომა რაგდან ყოველ კოდს აქვს თავისი წესი და ეს წესები უნდა დავიცვათ ამ მომენტში როგორც გვინდა ისე დავწერთ რადგან არის ცვლადი მაგრამ მთავარია არ დავუშვათ ესეთი შეცდომები 

credit = 19
Print(Credit)

Credit = 19
Print(credite)

CREDITE = 19 
Print(Credite )

#რადგან კომპიუტერი ჩათცლის როგორც შეცდომას