#      1) შექმენით სია რომელშიც იქნება მინიმუმ 10 სახელი შემდეგ ამ სიიდან ამოშალეთ ისეთი სახელები რომლის სიგრძეც იქნება 10ზე მეტი და დააბრუნეთ გაფილტრული სია გამოიყენეთ for loop და ნასწავლი ფუნქციები

names= ["დათო","ანა","გაბრიელი","ელიზავეტას","ჰიდროელექტროსადგური","ლუკა","თავპირდამტვრეული","საბა","ნიკა","გიორგი"]

filtered = []

for i in range(len(names)):
    if len(names[i]) <= 10:
        filtered.append(names[i])

print(filtered)        

names= ["დათო","ანა","გაბრიელი","ელიზავეტას","ჰიდროელექტროსადგური","ლუკა","თავპირდამტვრეული","საბა","ნიკა","გიორგი"]

filtered = []

for i in range(len(names)):
    if len(names[i]) > 10:
        filtered.append(names[i])
       
print(filtered) 
