# 21) გააკეთეთ კალკულატორი, სადაც მომხმარებელმა უნდა აირჩიოს რომელი მოქმედება უნდა (+, -, *, /) და შემოიტანოს ორი რიცხვი. შემდეგ კი დაპრინტეთ შედეგი.

operation = input("აირჩიეთ მოქმედება (+, -, *, /): ")
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

if operation == "+":
    print("შედეგი:", num1 + num2)
elif operation == "-":
    print("შედეგი:", num1 - num2)
elif operation == "*":
    print("შედეგი:", num1 * num2)
elif operation == "/":
    if num2 != 0:
        print("შედეგი:", num1 / num2)
    else:
        print("ნულზე გაყოფა შეუძლებელია!")
else:
    print("არასწორი ოპერაცია.")
