# 19) მომხმარებელს შემოატანინე სახელი, დაითვალე სახელებში ასოების რაოდენობა, იმ შემთხვევაში თუ ასოების რაოდენობა არის თქვენი სახელში ასოების რაოდენობის ტოლი, მაშინ დაიბეჭდოს რომ თქვენ სახელებში ერთნაირი დაოდენობის ასოებია. სხვა შემთხვევაში, კარგი სახელია. (count ფუნქცია არ გამოიყენოთ, ლუპით გააკეთეთ)
my_name = "ელენე"  
my_name_length = 0


for i in my_name:
    my_name_length += 1

user_name = input("შეიყვანეთ თქვენი სახელი: ")
user_name_length = 0


for i in user_name:
    user_name_length += 1


if user_name_length == my_name_length:
    print("ჩვენ სახელებში ერთნაირი რაოდენობის ასოებია!")
else:
    print("wow!")