# 10) კომენტარის სახით დაწერეთ როგორ გადავიყვანოთ მონაცემი სხვადასხვა მონაცემთა ტიპებში, (მაგ: ინტეჯერი სტრინგად და ა.შ)

# "10" არის string "სტრიქონი" და უნდა გადავიყვანოთ integer-ში
num = int("10")
print(num)

# 25 ეს არის integer-ი "მთელი რიცხვი" და გადავიყვანოთ string-ში
num_str = str(25)
print(num_str)

# 3.99 ეს არის float "ათწილადები" და უნდა გადავიყვანოთ integer-ში
num_int = int(3.99)
print(num_int)

# 5 არის integer "მთელი რიცხვი" და უნდა გადავიყვანოთ float-ში
num_float = float(5)
print(num_float)