# 3) დაწერე ფუნქცია, რომელიც ამოწმებს, არის თუ არა რიცხვი ნულზე დიდი.

#  number(num) - აქ ფუნქცია აიღებს num-იდან არგუმენტს და შეამოწმებს არის თუ არა დადებითი თუ უარყოფითი
# if num > 0 -თუ num არის 0-ზე მეტი ესეიგი დადებითია და გამოიტანს მნიშვნელობას greater than 0
# else თუ ეს პირობა არ იქნება შესრულებული Num თუ იქნება 0-ზე ნაკლები გამოგვიტანს less thjan 0 
# numb - მომხმარებელს ვთხოვთ შეიყვანოს რიცხვი რომ გავიგოთ დადებითი არის თუ უარყოფითი

def number(num):
    if num  > 0:
        return "Greater than 0"
    else:
        return "Less than 0"

numb = int(input("Enter  number: "))
print(number(numb))