# 2) დაწერე ფუნქცია, რომელიც ამოწმებს, არის თუ არა რიცხვი ლუწი.

# number(num) - აქ ფუნქცია აიღებს num-იდან არგუმენტს და შეამოწმებს არის თუ არა ლუწი ან კენტი 
# if num% 2 == 0 - თუ num იქნება ლუწი ფუნქცია აბრუნებს და ვიღებთ შედეგს even
# else - თუ ეს პირობა არ იქნება შესრულებული გამოვა რომ num არის კენტი და მივიღებთ შედეგს odd 
# numb - მომხმარებელს ვთხოვთ შეიყვანოს რიცხვი რომ გავიგოტ კენტი არის თუ ლიწი



def number(num):
    if num % 2 == 0:
        return "even"
    else:
        return "odd"

numb = int(input("Enter number: "))

print(number(numb))
