# 10) Beginner Series #1 School Paperwork
 
def paperwork(n, m):
    # Happy Coding! ^_^
    count = 0
    if n < 0 or m < 0:
        return count
    for i in range (n):
        count += m 
    return count
# თუ რომელიმე რიცხვი არის უარყოფითი მაშინ
#არ ვათვალიერებ საჭირო გვერდებს და დაგვიბრუნებს
#0-ს ციკლი გაივლის m-ჯერ რაც იმას ნიშნავს რომ 
#ყოველ კლას თითოეულ კლასისთვის M გვერდი იქნება 
#დამატებული count-შიშემდეგი მოქმედება კლასები 
#ერთმანეთს დაემატებიან m გვერდების რაოდენობაზე
#და დაგვიბრუნებს
#მთლიან გვერდების რაოდენობას ხო მაგარიააა