# 1) შექმენით რიცხვებით სავსე სია, შემდეგ დაწერეთ კოდი რომელიც დაბეჭდავს ამ სიიდან ყველაზე უდიდეს რიცხვს გამოგადგებათ for loop ი კარგად დაფიქრდით და გაიაზრეთ 

# ახსნა
# number1 = 0 ეს ცვლადი მომავალში გახდებაა სიის დიდი რიცხვი მაგრამ ჯერმას მივანიჭეთ 0 
#for i in numbers - ეს ციკლი გადავაყველა ელემენტზე რომელიც იქნება მოთვსებული numbers-ში 
#number1 = i - ბოლოს number1 მიენიჭება ის რიცხვი რომილიც იქნება სიაში ყველაზე დიდი


Numbers =[2,10,99,63,84,39,245,690,56,238,879]
Number1 = 0 

for i in Numbers:
    if i > Number1:
        Number1 = i 
print( Number1,"ეს იქნება შედეგი ანუ დიდი რიცხვი ")