# 2) თქვენით მოიფიქრეთ რაიმე სავარჯიშო რასაც გააკეთებთ if elif else ით ივარჯიშეთ დღევანდელ ნასწავლ მასალაზე ძალიან ბევრი


question1 = input("შენ იცი სად მდებარეობს საქართველო?")
if question1 == "yes":
    print("კარგია ეხლა ვშევუდგეთ შემდეგ კიტხვას.")
elif question1 == "no": 
    print("საქართველო მდებარეობს კავკასიიის მტებში!")
else:
    print("უნდა გეპასუხა კი ან არა.") 


question2 = input("გსმენია თუ არა ქართულ კერძებზე?")
if question2 =="yes":
    dish = input("აბა მითხარი რომელიმე ქართული კერძი?")
    print("ძალიან კარგი!")
elif question2 =="no":
    print("მე გეტყვი ჩემს საყვარელ ქართლ კერძს რომელიც არის 'ხაჭაპური!!'")   
else:
    print("უნდა გეპასუხა კი ან არა")


question3 = input("არასდროს მსმენია ამ კერძის შესახებ,გემრიელი კერძია ?")    
if question3 == "yes":
    print("ძალიან მიხარია თუ მოგეწონა")
elif question3 == "no":
    print("არადა საქართველოში ყველაზე გემრიელი კერზებია(")
else:
    print("უნდა გეპასუხა კი ან არა.")


question4 = input(" შენ ქალაქ თბილისში ცხოვრობ?")
if question4 == "yes":
    print("ვა მაგარია მეც)")
elif question4 == "no": 
    city = input("აბა რომელ ქალაქში ცხოვრობ?")
    print("კარგია,კარგია!" )
else:
    print("უნდა გეპასუხა კი ან არა")  


question5 = input(" ქართულ მუსიკებს უსმენ?")    
if question5 =="yes":
    music = input("რას უსმენ?")
    print("კაი გემოვნება გაქავს)")
elif question5 =="no":   
    print("არაუშავს ყველას აქვს თავისი გემოვნება) ")
else:
    print("უნდა გეპასუხა კი ან არა")   


question6 = input("შენ აპირებ ამ ზაფხულს დასვენებას?")    
if question6 =="yes":
    rest = input("სად აპირებ დასვენებას?")
    print("კარგი არჩევანია ")
elif question6 =="no":
    print("შემიძლია გირჩიო სა დაისვენო 'შეკვეთილი' , 'ურეკი' , 'სარფი' ")
else: 
    print("უნდა გეპასუხა კი ან არა")  


question7 = input("მოგწონს ჩვენი კულტურა?")
if question7 == "yes":
    print("უზომოდ გამიხარდა შენ ნამდივი ადამიანი ხარ 3<<")
elif question7 == "no": 
    print("შენ აქ არაფერი გესაქმება 'გადი აქედან '!!!!!!!!!!!!!! ")
else:
   print("უნდა გეპასუხა კი ან არა")


bye =input("მომავალ შეხვედრამდე 'bye-bye' ") 