# 2) თქვენით მოიფიქრეთ რაიმე სავარჯიშო რასაც გააკეთებთ if elif else ით ივარჯიშეთ დღევანდელ ნასწავლ მასალაზე ძალიან ბევრი


print("                                      გ ა მ ა რ ჯ ო ბ ა !!!!!!!!!!!")


print ("დავიწყოთ დიალოგი")
name = input("რა გქვია:?")
print("მე ელენე")

question1 = input("რესტორანებში დადიხარ?")
if question1 == "კი":
    dish =input(" რომელია თქვენი საყვარელი კერძი?")
    print("კაი გემოვნება გაქვს)")
elif question1 =="არა":
    dish = input("ესეიგი სახში გაკეტებული საჭმელი მოგწონს?")
    dish2 = input("რომელი სახლის კერძი უფრო მოგწონს?")
    print ("გეთანხმები სახში გაკეთებული საჭმელი ყოვრლთვის გემრიელია")    
else:
    print("უნდა გაგეცა პასუხები კი ან არა")    

question2 = input("favorite ფერი გაქვს ?")  
if question2 == "კი":
    color = input(" მაშინ რომელია თქვენი საყვარელი ფერი?")
    print("ჰმმ მე წითელი მომწონს მაგრამ თქვენი ფერიც ძალიან კაია )!")
elif question2 =="არა":
    color = input("კაი მაშინ მოდი ავირჩიოთ : წითელი, ლურჯი, თეთრი, შავი, მწვანე, იასამნისფერი,ნარინჯისფერი, ყვითელი, ვარდისფერი, ყავისფერი : რომელი ? ")
    color2 = input("მართლა ეს ფერი მოგეწონა?")
    print("ნამდვილად კაი ფერი ამოირჩიე )")
else:
    print("უნდა გაგეცა პასუხები კი ან არა")   
drink1 = ("მოდი აირჩიე რომელი გინდა :  გაზიანი , წვენი:")      
question3 = input("favorite  სასმელი გაქვს ? ") 
if  question3 =="კი":
    drink = input(" მაშინ  რომელია თქვენი საყვარელი სასმელი?")
    print("კაი არჩევანია)")
elif question3 == "არა":
 drink1 = input("მოდი აირჩიე რომელი გინდა :  გაზიანი , წვენი:")
if  drink1 == "გაზიანი": 
    carbonated = input (" კოკაკოლა , ფანტა , საპრაიტი , აკვაფრეში ,პეპსი ,ფანტა ტროპიკული ,მირინდა ვაშლის, მირინდა ფორთოხლის,  ")
    print("ჯობდა არც აგერჩია მაგრამ შენ აირჩიე მაინც , კაი შენი არცევანი იყო")
elif drink1 =="წვენი":   
    jus = input("სანდორა ალუბალი, სანდორა მანგო, სანდორა ბროწეული, სანდორა ვაშლი, სანდორა ფორთოხალი, სანდორა ანანასი, სანდორა შერეული, ჩერო ალუბალი, ჩერო ფორთოხალი, კაპი ალუბლის, კაპი ფორთოხლს, კაპი ტყის კენკრის, კაპი მანგო, კაპი ვაშლის, კაპი გრეიფრუტის, კაპი გარგარის, ლავი, ალოე, ")  
    print("ძალიან კარგი არჩევანია)")
else:
    print("")     

i = input("გაინტერესებს მე რომელს ვსვამ:? ")
if i =="კი":
    print("თავისთვად წვენს ვსვამ უფრო წვრილმანებით 'ფორთოხლის კაპს'")
elif i =="არა" :
    print("კაი")      
else:
    print("უნდა გაგეცა პასუხები კი ან არა")     

question4 =input("გაქვს ისეთი სასმელი რომელიც არ მოგწონს:?")
if question4 =="კი":
    hate = input("  რომელია თქვენი ყველაზე საძულველი სასმელი ?")
    print("ოჰჰო ყოჩაღ")
elif question4 =="არა":
    print("okay")
me = input("გაინტერესებს მე რომელი სასმელი მძულს:?")      
if me =="კი": 
    print("თვისთვად ყველაფერი რაც ეხება გაზიანს !!!!!!") 
elif me =="არა" : 
    print("კაი(") 
else:
    print("უნდა გეპასუხა კი ან არა")      

question5  = input(" მუსიკებს უსმენ?")    
if question5 =="კი":
    music = input("რას უსმენ?")
    print("კაი გემოვნება გაქავს)")
elif question5 =="არა":   
    print("არაუშავს ყველას აქვს თავისი გემოვნება) ")
else:
    print("უნდა გეპასუხა კი ან არა")      

question6 = input("ფილმებს უყურებ:?")
if question6 =="კი":
    movie = input("რომელია თქვენი საყვარელი ფილმი?")
    print("ვაუ კაი ფილმი გყვარებია")
elif question6 =="არა":
    print("კაი არაუშავს ბევრია ვინც არ უყურებს)")

question7 = input(" შენ ქალაქ თბილისში ცხოვრობ?")
if question4 == "კი":
    print("ვა მაგარია მეც)")
elif question4 == "არა": 
    city = input("აბა რომელ ქალაქში ცხოვრობ?")
    print("კარგია,კარგია!" )
else:
    print("უნდა გეპასუხა კი ან არა") 

question8 = input("რამე ოცნება გაქვს:?")     
if question8 =="კი":
    dream = input("რა ოცნება გაქვს:?")
    print("შენი ოცნება აუცილებლად ასრულდება, მე ამის მჯერა")
elif question8 =="არა":
    print("დროა რომ დააგროვო ოცნებებები))))))!!!!!!")  

print("                აბა ნახვამდის ძალიან მომეწინა შენთან ლაპარაკი შემდეგ შეხვედრამდე .")      