# 1) Is it a palindrome?

def is_palindrome(s):
    s = s.lower()
    if len(s) <= 1:
        return True
    if s[0] != s[-1]:
        return False
    return is_palindrome(s[1:-1])
    
    
 # ტაქ პირველ რიგში სტრინგი იქცევა პატარა ასოებად 
 # მერე თუ სტრინგის სიგრძე 1 ან ნაკლებია ეს რაღაც პალინდრომიაა
 # და ნუ დაბრუნდება  სწორია მერე თუ პირველი და ბოლო სიმბოლო ასო არ ემთცვევა
 # ის რაღაცა ანუ ფუნქცია დაგვიბრუნებს მცდარს ანუ უარყოფას
 # სხვა შემთხვევაში თუ ემთხვევა ისევ მიმართავ თავს თავიდან დააცალკევებს
 # პირველ და ბოლო ასოს/ სიმბოლოს  ეს პროცესი განმეორდება იქამდე სანამ არ მოხდება 
 # იმის გადამოწმება უი იმის ანუ სტრინგი რა ხო და ვსო 
   