# 5)შექმენი ფუნქცია რომელიც პარამეტრად მიიღებს ორ ცვლადს და ეს ცვლადები მნიშვნელობად მიიღებენ რიცხვებით სავსე სიებს,შენი დავალება იქნება რომ პირველი სიიდან ამოიღო ლუწი რიცხვები ხოლო მეორე სიიდან ამოიღო კენტი რიცხვები,შემდეგ გააერთიანე ეს რიცხვები ერთმანეთში და ამ გაერთიანებული სიიდან გამოიტანე ყოველ კენტ იდექსზე მდგომი რიცხვების ჯამი

def number(list1, list2):
    e = []
    for num in list1:
        if num % 2 == 0:
            e.append(num)
    

    o = []
    for num in list2:
        if num % 2 != 0:
            o.append(num)
    
    plus = e + o
    
    t = 0
    for i in range(1, len(plus), 2):
        t += plus[i]
    
    return t


list1 = [2, 4, 6, 8, 10]
list2 = [1, 3, 5, 7, 9]
over = number(list1, list2)
print(over)